#include <iostream>  // Подключение библиотеки для работы с потоками ввода-вывода
#include <clocale> // Подключение библиотеки для работы с локализацией
using namespace std; // Использование стандартного пространства имен
int main() // Главная функция программы
{ 
    setlocale(LC_ALL, "Russian"); // Установка локализации на русский язык
    int i, j = 0, f = 0; // Объявление переменных: i - количество элементов, j - индекс элемента, f - флажок (0 - False, 1 - True)
    cout << "Введите количество элементов " << endl; // Вывод сообщения пользователю о необходимости ввести количество элементов
    cin >> i; // Ввод количества элементов пользователем
    int a[i]; // Объявление массива размером i
    for (int k = 0; k < i; k++) // Цикл для перебора элементов массива при вводе
    { 
        cout << "Введите элемент массива: " << endl; // Вывод сообщения пользователю о необходимости ввести элемент массива
        cin >> a[k]; // Ввод элемента массива
    } 
    while (j < i - 1 && f == 0) // Цикл идёт, пока не перебраны все пары соседних элементов и нарушение не найдено
    { 
        if (a[j] >= a[j + 1]) // Проверка, является ли знак между соседними элементами больше или равно
        { 
            f = 1; // Если да, то флажок становится True и дальнейшая проверка не имеет смысла
        } 
        j++; // Переход к следующей паре соседних элементов
    } 
    if (f == 0) // Если флажок остался False, то нарушений знака не было
    { 
        cout << "Массив упорядочен по возрастанию" << endl; // Вывод сообщения, что массив упорядочен по возрастанию
    }
    else // Иначе нарушение знака было найдено
    { 
        cout << "Массив не упорядочен по возрастанию" << endl; // Вывод сообщения, что массив не упорядочен по возрастанию
    } 
    return 0; // Возврат значения 0 для успешного завершения программы
} 