#include <iostream>  // Подключение библиотеки для работы с потоками ввода-вывода
#include <clocale> // Подключение библиотеки для работы с локализацией
using namespace std; // Использование стандартного пространства имен
int main() // Главная функция программы
{
    setlocale(LC_ALL, "Russian"); // Установка локализации на русский язык
    int n, m, max, m1 = 0, m2 = 0; // Объявление переменных: n - количество строк, m - количество столбцов, max - максимальный элемент, m1 и m2 - его индексы
    cout << "Введите количество строк " << endl; // Вывод сообщения пользователю о необходимости ввести количество строк
    cin >> n; // Ввод количества строк пользователем
    cout << "Введите количество столбцов " << endl; // Вывод сообщения пользователю о необходимости ввести количество столбцов
    cin >> m; // Ввод количества столбцов пользователем
    int a[n][m]; // Объявление двумерного массива размером n на m
    for (int j = 0; j < n; j++) // Внешний цикл для перебора строк массива при вводе
    { 
        for (int k = 0; k < m; k++) // Внутренний цикл для перебора столбцов массива при вводе
        { 
            cout << "Введите элемент массива: " << endl; // Вывод сообщения пользователю о необходимости ввести элемент массива
            cin >> a[j][k]; // Ввод элемента массива пользователем
        } 
    } 
    max = a[0][0]; // Считаем первый элемент массива максимальным
    for (int j = 0; j < n; j++) // Внешний цикл для перебора строк массива при поиске максимума
    { 
        for (int k = 0; k < m; k++) // Внутренний цикл для перебора столбцов массива при поиске максимума
        { 
            if (a[j][k] > max) // Проверка, является ли текущий элемент массива больше текущего максимального значения
            { 
                max = a[j][k]; // Если да, то обновляем максимальное значение
                m1 = j; // Запоминаем номер строки максимального элемента
                m2 = k; // Запоминаем номер столбца максимального элемента
            } 
        } 
    } 
    cout << "Максимальный элемент: " << max << endl; // Вывод максимального элемента на экран
    cout << "Номер строки максимального элемента: " << m1 << endl; // Вывод номера строки максимального элемента на экран
    cout << "Номер столбца максимального элемента: " << m2 << endl; // Вывод номера столбца максимального элемента на экран
    return 0; // Возврат значения 0 для успешного завершения программы
}
