#include <iostream>  // Подключение библиотеки для работы с потоками ввода-вывода
#include <clocale> // Подключение библиотеки для работы с локализацией
using namespace std; // Использование стандартного пространства имен
int main() 
{ 
    setlocale(LC_ALL, "Russian"); // Установка локализации на русский язык
    int n, t; // Объявление переменных: n - количество элементов, t - временная переменная для обмена элементов местами
    cout << "Введите количество элементов " << endl; // Вывод сообщения пользователю о необходимости ввести количество элементов
    cin >> n; // Ввод количества элементов пользователем
    int a[n]; // Объявление одномерного массива размером n
    for (int i = 0; i < n; i++) // Цикл для перебора элементов массива при вводе
    { 
        cout << "Введите элемент массива: " << endl; // Вывод сообщения пользователю о необходимости ввести элемент массива
        cin >> a[i]; // Ввод элемента массива пользователем
    } 
    for (int i = 0; i < n - 1; i++) // Внешний цикл: выполняет n - 1 проход, после каждого прохода минимальный элемент встаёт на позицию i и исключается из обработки
    { 
        for (int j = n - 1; j > i; j--) // Внутренний цикл: просмотр соседних элементов массива, j идёт от последнего элемента до i + 1
        { 
            if (a[j - 1] > a[j]) // Проверка, является ли левый элемент больше правого
            { // Начало тела условия
                t = a[j - 1]; // Если да, то запоминаем левый элемент во временную переменную
                a[j - 1] = a[j]; // Ставим на место левого элемента правый элемент
                a[j] = t; // Ставим на место правого элемента запомненный левый элемент
            } 
        } 
    } 
    cout << "Отсортированный массив: " << endl; // Вывод сообщения о выводе отсортированного массива
    for (int i = 0; i < n; i++) // Цикл для перебора элементов массива при выводе
    { 
        cout << a[i] << " "; // Вывод элемента массива через пробел
    } 
    return 0; // Возврат значения 0 для успешного завершения программы
} 