#include <iostream>  // Подключение библиотеки для работы с потоками ввода-вывода
#include <clocale> // Подключение библиотеки для работы с локализацией
using namespace std; // Использование стандартного пространства имен
int main() 
{ 
    setlocale(LC_ALL, "Russian"); // Установка локализации на русский язык
    int n, j, Y, f; // Объявление переменных: n - количество элементов, j - индекс отсортированной части, Y - ячейка для вставляемого элемента, f - флажок (0 - False, 1 - True)
    cout << "Введите количество элементов " << endl; // Вывод сообщения пользователю о необходимости ввести количество элементов
    cin >> n; // Ввод количества элементов пользователем
    int a[n]; // Объявление одномерного массива размером n
    for (int i = 0; i < n; i++) // Цикл для перебора элементов массива при вводе
    { 
        cout << "Введите элемент массива: " << endl; // Вывод сообщения пользователю о необходимости ввести элемент массива
        cin >> a[i]; // Ввод элемента массива пользователем
    } 
    for (int i = 1; i < n; i++) // Внешний цикл: перебор элементов неотсортированной части, начиная со второго (отсортированная часть сначала состоит из первого элемента)
    { 
        Y = a[i]; // Переносим очередной элемент неотсортированной части в ячейку Y
        j = i - 1; // Индекс j указывает на последний элемент отсортированной части
        f = 0; // Перед началом внутреннего цикла флажок равен False, место для Y ещё не найдено
        while (j >= 0 && f == 0) // Внутренний поисковый цикл идёт, пока есть элементы в отсортированной части и место для Y не найдено
        { 
            if (a[j] > Y) // Проверка, является ли текущий элемент отсортированной части больше Y
            { 
                a[j + 1] = a[j]; // Если да, то сдвигаем элемент на одну позицию вправо
                j--; // Переходим к предыдущему элементу отсортированной части
            } 
            else // Иначе место для Y найдено
            { 
                f = 1; // Флажок становится True и дальнейший поиск не имеет смысла
            } 
        } 
        a[j + 1] = Y; // Вставляем Y на найденное место в отсортированной части
    } 
    cout << "Отсортированный массив: " << endl; // Вывод сообщения о выводе отсортированного массива
    for (int i = 0; i < n; i++) // Цикл для перебора элементов массива при выводе
    { 
        cout << a[i] << " "; // Вывод элемента массива через пробел
    } 
    cout << endl; // Переход на новую строку
    return 0; // Возврат значения 0 для успешного завершения программы
}
