#include <iostream>  // Подключение библиотеки для работы с потоками ввода-вывода
#include <clocale> // Подключение библиотеки для работы с локализацией
using namespace std; // Использование стандартного пространства имен
int main() // Главная функция программы
{
    setlocale(LC_ALL, "Russian"); // Установка локализации на русский язык
    int i,max,min,m1,m2,s1=0,s2=0;
    m1=0;
    m2=0;
    cout << "Введите количество столбцов " << endl; // Вывод сообщения пользователю о необходимости ввести количество столбцов
    cin >> i;
    int a[i]; // Объявление одномерного массива размером i
    for (int j = 0; j < i; j++) // Внешний цикл для перебора строк массива
    {
        cout << "Введите элемент массива: " << endl; // Вывод сообщения пользователю о необходимости ввести элемент массива
        cin >> a[j]; // Ввод элемента массива пользователем
    }
    max = a[0];
    min = a[0];
    for (int j = 0; j < i; j++) // Внешний цикл для перебора массива
    {
        if (a[j] > max) // Проверка, является ли текущий элемент массива больше текущего максимального значения
        {
            max = a[j]; // Если да, то обновляем максимальное значение
            m1=j; // Запоминаем индекс максимального элемента
        }
        if (a[j] < min) // Проверка, является ли текущий элемент массива меньше текущего минимального значения
        {
            min = a[j]; // Если да, то обновляем минимальное значение
            m2=j; // Запоминаем индекс минимального элемента
        }
    }
    cout << "Максимальный элемент: " << max << endl;
    cout << "Минимальный элемент: " << min << endl;
    cout << "Индекс максимального элемента: " << m1 << endl;
    cout << "Индекс минимального элемента: " << m2 << endl;
    for (int j = 0; j < i; j++) // Отдельный цикл для нахождения количества максиальных и минимальных
    {
        if (a[j] == max) // Если текущий элемент равен max
        {
            s1+=1; // Если да, прибавляем к счётчику 1
        }
        if (a[j] == min) // Если текущий элемент равен min
        {  
            s2+=1; // Если да, прибавляем к счётчику 1
        }
    }
    if (s1>1) // Если счётчик стал больше 1
    {
        cout << "Количество максимальных" << s1 << endl; // То выводим количество максимальных
    }
    if (s2>1) // Если счётчик стал больше 1
    {
        cout << "Количество минимальных" << s2 << endl; /// То выводим количество минимальных
   }
   return 0;
}