#include <iostream>  // Подключение библиотеки для работы с потоками ввода-вывода
#include <clocale> // Подключение библиотеки для работы с локализацией
#include <stdlib.h> // Подключение библиотеки для работы с функцией rand()
using namespace std; // Использование стандартного пространства имен
int main() // Главная функция программы
{
    setlocale(LC_ALL, "Russian"); // Установка локализации на русский язык
    int i, sum = 0; // Объявление переменной для количества столбцов и переменной для суммы элементов массива
    cout << "Введите количество столбцов " << endl; // Вывод сообщения пользователю о необходимости ввести количество столбцов
    cin >> i; // Ввод количества столбцов пользователем
    int a[2][i]; // Объявление двумерного массива размером 2 на i
    for (int j = 0; j < 2; j++) // Внешний цикл для перебора строк массива
    {
        for (int k = 0; k < i; k++) // Внутренний цикл для перебора столбцов массива
        {
            a[j][k] = rand() % 100 ; // Заполнение массива случайными числами от 0 до 99
            sum += a[j][k]; // Добавление текущего элемента массива к сумме
        }
    }
    cout << "Сумма элементов массива: " << sum << endl; // Вывод суммы элементов массива на экран
    return 0; // Возврат значения 0 для успешного завершения программы
}
