#include <iostream> //Подключение библиотеки для ввода-вывода
using namespace std; //Использование стандартного пространства имен
int main(){ //Главная функция
    int n = 1; //Объявление целочисленной переменной n и присвоение ей значения 1
    int m = 2; //Объявление целочисленной переменной m и присвоение ей значения 2
    int ans1 = ++n*++m; //Объявление переменной ans1 и присвоение ей значения (n+1)*(m+1)
    bool ans2 = m++<n; //Объявление переменной ans2 и присвоение ей значения (m < n) после увеличения m
    bool ans3 = n++>m; //Объявление переменной ans3 и присвоение ей значения (n > m) после увеличения n
    cout << ans1 << "," << ans2 << "," << ans3 << endl; //Вывод значений ans1, ans2 и ans3 на экран
    return 0; //Возвращение значения 0
}
