#include <iostream> //Подключение библиотеки для ввода-вывода
#include <cmath> //Подключение библиотеки для математических функций
using namespace std; //Использование стандартного пространства имен
int main(){ //Главная функция
    int a = 1000; //Объявление целочисленной переменной a и присвоение ей значения 1000
    float b = 0.0001; //Объявление переменной с плавающей точкой b и присвоение ей значения 0.0001
    float c = pow(a+b,3); //Объявление переменной float c и присвоение ей значения (a+b)^3 (1ое действие)
    double d = pow(a+b,3); //Объявление переменной double d и присвоение ей значения (a+b)^3 (1ое действие)
    cout << c << "," << d << endl; //Вывод значений float c и double d на экран для сравнения точности вычислений первого действия
    float e = pow(a,3) - 2*a*b; //Объявление переменной float e и присвоение ей значения a^3 - 2*a*b (2ое действие)
    double f = pow(a,3) - 2*a*b; //Объявление переменной double f и присвоение ей значения a^3 - 2*a*b (2ое действие)
    cout << e << "," << f << endl; //Вывод значений float e и double f на экран для сравнения точности вычислений второго действия
    float g = pow(b,2); //Объявление переменной float g и присвоение ей значения b^2 (3ое действие)
    double h = pow(b,2); //Объявление переменной double h и присвоение ей значения b^2 (3ое действие)
    cout << g << "," << h << endl; //Вывод значений float g и double h на экран для сравнения точности вычислений третьего действия
    float i = (c - e); //Объявление переменной float i и присвоение ей значения (c - e)/g (4ое действие)
    double j = (d - f); //Объявление переменной double j и присвоение ей значения (d - f)/h (4ое действие)
    cout << i << "," << j << endl; //Вывод значений float i и double j на экран для сравнения точности вычислений четвертого действия
    float k = i/g; //Объявление переменной float k и присвоение ей значения (c - e)/g (5ое действие)
    double l = j/h; //Объявление переменной double l и присвоение ей значения (d - f)/h (5ое действие)
    cout << k << "," << l << endl; //Вывод значений float k и double l на экран для сравнения точности вычислений пятого действия
    return 0; //Возвращение значения 0
}