#include <iostream>   // подключаем библиотеку ввода-вывода
#include <cmath>      // подключаем математические функции 
using namespace std;  // используем стандартное пространство имён
int main()            // главная функция 
{
    const double PI = 3.14159; // задаём число пи
    double a = PI / 5;        // левая граница диапазона: пи/5
    double b = 9 * PI / 5;    // правая граница диапазона: 9*пи/5
    int k = 10;               // k заданное по условию
    int n = 40;               // n заданное по условию
    double eps = 0.0001;      // заданная точность эпсило
    double h = (b - a) / k;   // шаг изменения x
    double x = a;                          // начальное значение x
    for (int i = 0; i <= k; i++)           // внешний цикл: изменение параметра x 
    {
        double SN = 0;                     // сумма для заданного n
        for (int j = 1; j <= n; j++)       // внутренний цикл: j от 1 до n
        {
            SN += cos(j * x) / j;          // прибавляем член ряда cos(j*x)/j
        }
        double SE = 0;                     // сумма для заданной точности
        int m = 1;                         // номер первого члена 
        double an = cos(m * x) / m;        // вычисляем первый член
        while (fabs(an) >= eps)            // внутренний цикл: пока модуль (an) >= eps
        {
            SE += an;                      // прибавляем текущий член к сумме
            m++;                           // переходим к следующему номеру члена
            an = cos(m * x) / m;           // вычисляем следующий член
        }
        double Y = -log(fabs(2 * sin(x / 2))); // значение функции y 
        cout << "X=" << x << "  SN=" << SN << "  SE=" << SE << "  Y=" << Y << endl; // Вывод результатов пунктов а и б, а также сама функция 
        x += h;                            // переходим к следующему x
    }
    return 0;                              // возвращаем 0
}