#include <iostream> // подключение библиотеки ввода-вывода
using namespace std; // использование стандартного пространства имен
int main() // главная функция программы
{
    int sum = 0; // инициализация переменной для хранения суммы
    for (int i = 1; i < 100; i++) // цикл от 1 до 99
    {
        if (i%2==0) // проверка, является ли число четным
        {
            sum+=i; // добавление четного числа к сумме
        }
    }
    cout << sum; // вывод суммы четных чисел от 1 до 99
    return 0; // завершение программы
}